# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой 
# грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть 
# ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное 
# число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система 
# состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один 
# заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с 
# двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один 
# заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

n = int(input('Введите количество кустов: '))

if n <= 3:
    print(sum([int(input('Введите кол-во ягод на i-м кусте: ')) for i in range(n)]))
else:
    list_berries_qty = [int(input('Введите кол-во ягод на i-м кусте: ')) for i in range(n)]
    list_harvest = []
    for i in range(0,n-2):
        list_harvest.append(sum(list_berries_qty[i:i+3]))
    for i in range(n-2,n):
        if i == n-2:
            list_harvest.append(sum(list_berries_qty[i:i+2])+list_berries_qty[0])
        else:
            list_harvest.append(list_berries_qty[i]+sum(list_berries_qty[:2]))
    print(max(list_harvest))